import React from "react";
import "./Blog.css";
import { useParams, useNavigate } from "react-router-dom";
import { Data } from "./Blog.type";
import Col from "react-bootstrap/Col";
import Form from "react-bootstrap/Form";
import Row from "react-bootstrap/Row";
import Button from "react-bootstrap/Button";
import { IoShareSocialOutline } from "react-icons/io5";
import { GrFavorite } from "react-icons/gr";

export default function Blog() {
  const { id } = useParams<{ id: string }>();
  const navigate = useNavigate();

  const blogData: Data[] = [
    {
      id: 1,
      title: "قیمت گوشی‌های هوشمند از برند شیائومی در هند کاهش یافت",
      subtitle: " گیمینگ ",
      subtitle2: " هیولای وردپرس ",
      subtitle3: "  آبان 1403 ",
      img: "https://themes.wpmonster.co/Phlox/new/gadget-shop/wp-content/uploads/2024/04/90-angle-IsIQXkDENBo-unsplash-1-min-637x388.jpeg",
      parg: "اِلِکترونیک دانشی است شامل فیزیک، مهندسی، فناوری و کاربردهایی که با جریان و کنترل الکترون‌ها در خلا و ماده سروکار دارد. در الکترونیک برای کنترل جریان الکترون از دستگاه‌های فعال تقویت و یکسوسازی استفاده می‌شود، درحالی‌که در مهندسی برق کلاسیک از اثرات غیرفعال مانند مقاومت، خازن و القاگر برای کنترل جریان الکتریسیته استفاده می‌شود.",
      parg2:
        "الکترونیک تأثیر عمده‌ای در پیشرفت جامعه مدرن داشته‌است. شناسایی الکترون در سال ۱۸۹۷، و سپس اختراع لامپ خلأ که می‌توانست سیگنال‌های کوچک الکتریکی را تقویت و یکسوسازی کند، زمینه الکترونیک و عصر الکترون را افتتاح کرد. این تمایز در حدود سال ۱۹۰۶ با اختراع لی دفارست از تریود آغاز شد، که تقویت الکتریکی سیگنال‌های رادیویی ضعیف و سیگنال‌های صوتی را با دستگاه غیر مکانیکی امکان‌پذیر کرد. تا سال ۱۹۵۰، این رشته «فناوری رادیویی» نامیده می‌شد زیرا کاربرد اصلی آن طراحی و تئوری فرستنده‌های رادیویی، گیرنده‌ها و لامپ‌های خلأ بود.",
      parg3:
        "عبارت «الکترونیک حالت-جامد» پس از ساخت اولین ترانزیستور توسط ویلیام شاکلی، والتر هاوسر براتین، جان باردین در آزمایشگاه‌های بل در ۱۹۴۷ ظهور کرد. سپس در سال ۱۹۵۹ ماسفت توسط محمد عطاالله (و همکارش داوون کانگ) اختراع شد. ماسفت اولین ترانزیستور کاملاً جمع و جور بود که می‌توانست برای طیف وسیعی از کاربردها کوچک سازی و تولید انبوه شود، که باعث ایجاد انقلابی در صنعت الکترونیک شد و نقشی اساسی در انقلاب میکروالکترونیک و انقلاب دیجیتال داشت. ماسفت از آن زمان به عنصر اصلی اکثر تجهیزات الکترونیکی مدرن تبدیل شده‌است و پرکاربردترین دستگاه الکترونیکی در جهان است.",
      parg4:
        "از الکترونیک به‌طور گسترده‌ای در پردازش اطلاعات، ارتباطات از راه دور و پردازش سیگنال استفاده می‌شود. توانایی دستگاه‌های الکترونیکی در عملکرد به عنوان کلید، پردازش اطلاعات دیجیتالی را امکان‌پذیر کرده‌است. فناوری‌های اتصال متقابل مانند بردهای مدار، فناوری بسته‌بندی الکترونیکی و سایر اشکال متنوع زیرساخت‌های ارتباطی، عملکرد مدار را کامل کرده و قطعات الکترونیکی مخلوط را به یک سیستم کاری منظم تبدیل می‌کنند، که سیستم الکترونیکی نامیده می‌شود. کامپیوترها یا سیستم‌های کنترل نمونه‌هایی از سیستم الکترونیکی هستند. یک سیستم الکترونیکی ممکن است جزئی از سیستم مهندسی شده دیگر یا یک دستگاه مستقل باشد. از سال ۲۰۱۹ بیشتر دستگاه‌های الکترونیکی[۳] از قطعات نیمه هادی برای انجام کنترل الکترون استفاده می‌کنند. معمولاً، دستگاه‌های الکترونیکی شامل مدارهای متشکل از نیمه رساناهای فعال با المان‌های غیرفعال مکمل هستند. چنین مداری به عنوان مدار الکترونیکی توصیف می‌شود. علم الکترونیک با مدارهای الکتریکی سروکار دارد که شامل اجزای الکتریکی فعال مانند لامپ‌های خلأ، ترانزیستورها، دیودها، مدارهای مجتمع، الکترونیک نوری، و سنسورها، قطعات الکتریکی غیرفعال همراه و فناوری‌های اتصال داخلی هیولای وردپرس هستند.",
    },
    {
      id: 2,
      title: "تاریخ دقیق عرضه و رونمایی گوشی جدید تاشوی سامسونگ اعلام شد",
      subtitle: "تکنولوژی ",
      subtitle2: "هیولای وردپرس",
      subtitle3: "   آبان 1403 ",
      img: "https://themes.wpmonster.co/Phlox/new/gadget-shop/wp-content/uploads/2024/04/krisztian-tabori-IyaNci0CyRk-unsplash-min-637x388.jpeg",
      parg: "اِلِکترونیک دانشی است شامل فیزیک، مهندسی، فناوری و کاربردهایی که با جریان و کنترل الکترون‌ها در خلا و ماده سروکار دارد. در الکترونیک برای کنترل جریان الکترون از دستگاه‌های فعال تقویت و یکسوسازی استفاده می‌شود، درحالی‌که در مهندسی برق کلاسیک از اثرات غیرفعال مانند مقاومت، خازن و القاگر برای کنترل جریان الکتریسیته استفاده می‌شود.",
      parg2:
        "الکترونیک تأثیر عمده‌ای در پیشرفت جامعه مدرن داشته‌است. شناسایی الکترون در سال ۱۸۹۷، و سپس اختراع لامپ خلأ که می‌توانست سیگنال‌های کوچک الکتریکی را تقویت و یکسوسازی کند، زمینه الکترونیک و عصر الکترون را افتتاح کرد. این تمایز در حدود سال ۱۹۰۶ با اختراع لی دفارست از تریود آغاز شد، که تقویت الکتریکی سیگنال‌های رادیویی ضعیف و سیگنال‌های صوتی را با دستگاه غیر مکانیکی امکان‌پذیر کرد. تا سال ۱۹۵۰، این رشته «فناوری رادیویی» نامیده می‌شد زیرا کاربرد اصلی آن طراحی و تئوری فرستنده‌های رادیویی، گیرنده‌ها و لامپ‌های خلأ بود.",
      parg3:
        "عبارت «الکترونیک حالت-جامد» پس از ساخت اولین ترانزیستور توسط ویلیام شاکلی، والتر هاوسر براتین، جان باردین در آزمایشگاه‌های بل در ۱۹۴۷ ظهور کرد. سپس در سال ۱۹۵۹ ماسفت توسط محمد عطاالله (و همکارش داوون کانگ) اختراع شد. ماسفت اولین ترانزیستور کاملاً جمع و جور بود که می‌توانست برای طیف وسیعی از کاربردها کوچک سازی و تولید انبوه شود، که باعث ایجاد انقلابی در صنعت الکترونیک شد و نقشی اساسی در انقلاب میکروالکترونیک و انقلاب دیجیتال داشت. ماسفت از آن زمان به عنصر اصلی اکثر تجهیزات الکترونیکی مدرن تبدیل شده‌است و پرکاربردترین دستگاه الکترونیکی در جهان است.",
      parg4:
        "از الکترونیک به‌طور گسترده‌ای در پردازش اطلاعات، ارتباطات از راه دور و پردازش سیگنال استفاده می‌شود. توانایی دستگاه‌های الکترونیکی در عملکرد به عنوان کلید، پردازش اطلاعات دیجیتالی را امکان‌پذیر کرده‌است. فناوری‌های اتصال متقابل مانند بردهای مدار، فناوری بسته‌بندی الکترونیکی و سایر اشکال متنوع زیرساخت‌های ارتباطی، عملکرد مدار را کامل کرده و قطعات الکترونیکی مخلوط را به یک سیستم کاری منظم تبدیل می‌کنند، که سیستم الکترونیکی نامیده می‌شود. کامپیوترها یا سیستم‌های کنترل نمونه‌هایی از سیستم الکترونیکی هستند. یک سیستم الکترونیکی ممکن است جزئی از سیستم مهندسی شده دیگر یا یک دستگاه مستقل باشد. از سال ۲۰۱۹ بیشتر دستگاه‌های الکترونیکی[۳] از قطعات نیمه هادی برای انجام کنترل الکترون استفاده می‌کنند. معمولاً، دستگاه‌های الکترونیکی شامل مدارهای متشکل از نیمه رساناهای فعال با المان‌های غیرفعال مکمل هستند. چنین مداری به عنوان مدار الکترونیکی توصیف می‌شود. علم الکترونیک با مدارهای الکتریکی سروکار دارد که شامل اجزای الکتریکی فعال مانند لامپ‌های خلأ، ترانزیستورها، دیودها، مدارهای مجتمع، الکترونیک نوری، و سنسورها، قطعات الکتریکی غیرفعال همراه و فناوری‌های اتصال داخلی هیولای وردپرس هستند.",
    },
    {
      id: 3,
      title: "قیمت گوشی‌های هوشمند از برند شیائومی در هند کاهش یافت",
      subtitle: "دکوراسیون",
      subtitle2: "هیولای وردپرس",
      subtitle3: "   آبان 1403 ",
      img: "https://themes.wpmonster.co/Phlox/new/gadget-shop/wp-content/uploads/2024/04/daniel-korpai-3qELJetpWsU-unsplash-min-637x388.jpeg",
      parg: "اِلِکترونیک دانشی است شامل فیزیک، مهندسی، فناوری و کاربردهایی که با جریان و کنترل الکترون‌ها در خلا و ماده سروکار دارد. در الکترونیک برای کنترل جریان الکترون از دستگاه‌های فعال تقویت و یکسوسازی استفاده می‌شود، درحالی‌که در مهندسی برق کلاسیک از اثرات غیرفعال مانند مقاومت، خازن و القاگر برای کنترل جریان الکتریسیته استفاده می‌شود.",
      parg2:
        "الکترونیک تأثیر عمده‌ای در پیشرفت جامعه مدرن داشته‌است. شناسایی الکترون در سال ۱۸۹۷، و سپس اختراع لامپ خلأ که می‌توانست سیگنال‌های کوچک الکتریکی را تقویت و یکسوسازی کند، زمینه الکترونیک و عصر الکترون را افتتاح کرد. این تمایز در حدود سال ۱۹۰۶ با اختراع لی دفارست از تریود آغاز شد، که تقویت الکتریکی سیگنال‌های رادیویی ضعیف و سیگنال‌های صوتی را با دستگاه غیر مکانیکی امکان‌پذیر کرد. تا سال ۱۹۵۰، این رشته «فناوری رادیویی» نامیده می‌شد زیرا کاربرد اصلی آن طراحی و تئوری فرستنده‌های رادیویی، گیرنده‌ها و لامپ‌های خلأ بود.",
      parg3:
        "عبارت «الکترونیک حالت-جامد» پس از ساخت اولین ترانزیستور توسط ویلیام شاکلی، والتر هاوسر براتین، جان باردین در آزمایشگاه‌های بل در ۱۹۴۷ ظهور کرد. سپس در سال ۱۹۵۹ ماسفت توسط محمد عطاالله (و همکارش داوون کانگ) اختراع شد. ماسفت اولین ترانزیستور کاملاً جمع و جور بود که می‌توانست برای طیف وسیعی از کاربردها کوچک سازی و تولید انبوه شود، که باعث ایجاد انقلابی در صنعت الکترونیک شد و نقشی اساسی در انقلاب میکروالکترونیک و انقلاب دیجیتال داشت. ماسفت از آن زمان به عنصر اصلی اکثر تجهیزات الکترونیکی مدرن تبدیل شده‌است و پرکاربردترین دستگاه الکترونیکی در جهان است.",
      parg4:
        "از الکترونیک به‌طور گسترده‌ای در پردازش اطلاعات، ارتباطات از راه دور و پردازش سیگنال استفاده می‌شود. توانایی دستگاه‌های الکترونیکی در عملکرد به عنوان کلید، پردازش اطلاعات دیجیتالی را امکان‌پذیر کرده‌است. فناوری‌های اتصال متقابل مانند بردهای مدار، فناوری بسته‌بندی الکترونیکی و سایر اشکال متنوع زیرساخت‌های ارتباطی، عملکرد مدار را کامل کرده و قطعات الکترونیکی مخلوط را به یک سیستم کاری منظم تبدیل می‌کنند، که سیستم الکترونیکی نامیده می‌شود. کامپیوترها یا سیستم‌های کنترل نمونه‌هایی از سیستم الکترونیکی هستند. یک سیستم الکترونیکی ممکن است جزئی از سیستم مهندسی شده دیگر یا یک دستگاه مستقل باشد. از سال ۲۰۱۹ بیشتر دستگاه‌های الکترونیکی[۳] از قطعات نیمه هادی برای انجام کنترل الکترون استفاده می‌کنند. معمولاً، دستگاه‌های الکترونیکی شامل مدارهای متشکل از نیمه رساناهای فعال با المان‌های غیرفعال مکمل هستند. چنین مداری به عنوان مدار الکترونیکی توصیف می‌شود. علم الکترونیک با مدارهای الکتریکی سروکار دارد که شامل اجزای الکتریکی فعال مانند لامپ‌های خلأ، ترانزیستورها، دیودها، مدارهای مجتمع، الکترونیک نوری، و سنسورها، قطعات الکتریکی غیرفعال همراه و فناوری‌های اتصال داخلی هیولای وردپرس هستند.",
    },
    {
      id: 4,
      title: "مدیریت روزمرگی و برنامه‌ریزی هوشمندانه جهت فتح کسب‌وکار",
      subtitle: "تکنولوژی",
      subtitle2: "هیولای وردپرس",
      subtitle3: "   آبان 1403 ",
      img: "https://themes.wpmonster.co/Phlox/new/gadget-shop/wp-content/uploads/2024/04/trent-erwin-UgA3Xvi3SkA-unsplash-min-637x388.jpeg",
      parg: "اِلِکترونیک دانشی است شامل فیزیک، مهندسی، فناوری و کاربردهایی که با جریان و کنترل الکترون‌ها در خلا و ماده سروکار دارد. در الکترونیک برای کنترل جریان الکترون از دستگاه‌های فعال تقویت و یکسوسازی استفاده می‌شود، درحالی‌که در مهندسی برق کلاسیک از اثرات غیرفعال مانند مقاومت، خازن و القاگر برای کنترل جریان الکتریسیته استفاده می‌شود.",
      parg2:
        "الکترونیک تأثیر عمده‌ای در پیشرفت جامعه مدرن داشته‌است. شناسایی الکترون در سال ۱۸۹۷، و سپس اختراع لامپ خلأ که می‌توانست سیگنال‌های کوچک الکتریکی را تقویت و یکسوسازی کند، زمینه الکترونیک و عصر الکترون را افتتاح کرد. این تمایز در حدود سال ۱۹۰۶ با اختراع لی دفارست از تریود آغاز شد، که تقویت الکتریکی سیگنال‌های رادیویی ضعیف و سیگنال‌های صوتی را با دستگاه غیر مکانیکی امکان‌پذیر کرد. تا سال ۱۹۵۰، این رشته «فناوری رادیویی» نامیده می‌شد زیرا کاربرد اصلی آن طراحی و تئوری فرستنده‌های رادیویی، گیرنده‌ها و لامپ‌های خلأ بود.",
      parg3:
        "عبارت «الکترونیک حالت-جامد» پس از ساخت اولین ترانزیستور توسط ویلیام شاکلی، والتر هاوسر براتین، جان باردین در آزمایشگاه‌های بل در ۱۹۴۷ ظهور کرد. سپس در سال ۱۹۵۹ ماسفت توسط محمد عطاالله (و همکارش داوون کانگ) اختراع شد. ماسفت اولین ترانزیستور کاملاً جمع و جور بود که می‌توانست برای طیف وسیعی از کاربردها کوچک سازی و تولید انبوه شود، که باعث ایجاد انقلابی در صنعت الکترونیک شد و نقشی اساسی در انقلاب میکروالکترونیک و انقلاب دیجیتال داشت. ماسفت از آن زمان به عنصر اصلی اکثر تجهیزات الکترونیکی مدرن تبدیل شده‌است و پرکاربردترین دستگاه الکترونیکی در جهان است.",
      parg4:
        "از الکترونیک به‌طور گسترده‌ای در پردازش اطلاعات، ارتباطات از راه دور و پردازش سیگنال استفاده می‌شود. توانایی دستگاه‌های الکترونیکی در عملکرد به عنوان کلید، پردازش اطلاعات دیجیتالی را امکان‌پذیر کرده‌است. فناوری‌های اتصال متقابل مانند بردهای مدار، فناوری بسته‌بندی الکترونیکی و سایر اشکال متنوع زیرساخت‌های ارتباطی، عملکرد مدار را کامل کرده و قطعات الکترونیکی مخلوط را به یک سیستم کاری منظم تبدیل می‌کنند، که سیستم الکترونیکی نامیده می‌شود. کامپیوترها یا سیستم‌های کنترل نمونه‌هایی از سیستم الکترونیکی هستند. یک سیستم الکترونیکی ممکن است جزئی از سیستم مهندسی شده دیگر یا یک دستگاه مستقل باشد. از سال ۲۰۱۹ بیشتر دستگاه‌های الکترونیکی[۳] از قطعات نیمه هادی برای انجام کنترل الکترون استفاده می‌کنند. معمولاً، دستگاه‌های الکترونیکی شامل مدارهای متشکل از نیمه رساناهای فعال با المان‌های غیرفعال مکمل هستند. چنین مداری به عنوان مدار الکترونیکی توصیف می‌شود. علم الکترونیک با مدارهای الکتریکی سروکار دارد که شامل اجزای الکتریکی فعال مانند لامپ‌های خلأ، ترانزیستورها، دیودها، مدارهای مجتمع، الکترونیک نوری، و سنسورها، قطعات الکتریکی غیرفعال همراه و فناوری‌های اتصال داخلی هیولای وردپرس هستند.",
    },
    {
      id: 5,
      title: "مزایا و معایب رشد مدرنیزه شدن زندگی و تاثیر مهم تکنولوژی",
      subtitle: "گیمینگ",
      subtitle2: "هیولای وردپرس",
      subtitle3: "   آبان 1403 ",
      img: "https://themes.wpmonster.co/Phlox/new/gadget-shop/wp-content/uploads/2024/04/kobu-agency-0mletxmBcVQ-unsplash-min-637x388.jpeg",
      parg: "اِلِکترونیک دانشی است شامل فیزیک، مهندسی، فناوری و کاربردهایی که با جریان و کنترل الکترون‌ها در خلا و ماده سروکار دارد. در الکترونیک برای کنترل جریان الکترون از دستگاه‌های فعال تقویت و یکسوسازی استفاده می‌شود، درحالی‌که در مهندسی برق کلاسیک از اثرات غیرفعال مانند مقاومت، خازن و القاگر برای کنترل جریان الکتریسیته استفاده می‌شود.",
      parg2:
        "الکترونیک تأثیر عمده‌ای در پیشرفت جامعه مدرن داشته‌است. شناسایی الکترون در سال ۱۸۹۷، و سپس اختراع لامپ خلأ که می‌توانست سیگنال‌های کوچک الکتریکی را تقویت و یکسوسازی کند، زمینه الکترونیک و عصر الکترون را افتتاح کرد. این تمایز در حدود سال ۱۹۰۶ با اختراع لی دفارست از تریود آغاز شد، که تقویت الکتریکی سیگنال‌های رادیویی ضعیف و سیگنال‌های صوتی را با دستگاه غیر مکانیکی امکان‌پذیر کرد. تا سال ۱۹۵۰، این رشته «فناوری رادیویی» نامیده می‌شد زیرا کاربرد اصلی آن طراحی و تئوری فرستنده‌های رادیویی، گیرنده‌ها و لامپ‌های خلأ بود.",
      parg3:
        "عبارت «الکترونیک حالت-جامد» پس از ساخت اولین ترانزیستور توسط ویلیام شاکلی، والتر هاوسر براتین، جان باردین در آزمایشگاه‌های بل در ۱۹۴۷ ظهور کرد. سپس در سال ۱۹۵۹ ماسفت توسط محمد عطاالله (و همکارش داوون کانگ) اختراع شد. ماسفت اولین ترانزیستور کاملاً جمع و جور بود که می‌توانست برای طیف وسیعی از کاربردها کوچک سازی و تولید انبوه شود، که باعث ایجاد انقلابی در صنعت الکترونیک شد و نقشی اساسی در انقلاب میکروالکترونیک و انقلاب دیجیتال داشت. ماسفت از آن زمان به عنصر اصلی اکثر تجهیزات الکترونیکی مدرن تبدیل شده‌است و پرکاربردترین دستگاه الکترونیکی در جهان است.",
      parg4:
        "از الکترونیک به‌طور گسترده‌ای در پردازش اطلاعات، ارتباطات از راه دور و پردازش سیگنال استفاده می‌شود. توانایی دستگاه‌های الکترونیکی در عملکرد به عنوان کلید، پردازش اطلاعات دیجیتالی را امکان‌پذیر کرده‌است. فناوری‌های اتصال متقابل مانند بردهای مدار، فناوری بسته‌بندی الکترونیکی و سایر اشکال متنوع زیرساخت‌های ارتباطی، عملکرد مدار را کامل کرده و قطعات الکترونیکی مخلوط را به یک سیستم کاری منظم تبدیل می‌کنند، که سیستم الکترونیکی نامیده می‌شود. کامپیوترها یا سیستم‌های کنترل نمونه‌هایی از سیستم الکترونیکی هستند. یک سیستم الکترونیکی ممکن است جزئی از سیستم مهندسی شده دیگر یا یک دستگاه مستقل باشد. از سال ۲۰۱۹ بیشتر دستگاه‌های الکترونیکی[۳] از قطعات نیمه هادی برای انجام کنترل الکترون استفاده می‌کنند. معمولاً، دستگاه‌های الکترونیکی شامل مدارهای متشکل از نیمه رساناهای فعال با المان‌های غیرفعال مکمل هستند. چنین مداری به عنوان مدار الکترونیکی توصیف می‌شود. علم الکترونیک با مدارهای الکتریکی سروکار دارد که شامل اجزای الکتریکی فعال مانند لامپ‌های خلأ، ترانزیستورها، دیودها، مدارهای مجتمع، الکترونیک نوری، و سنسورها، قطعات الکتریکی غیرفعال همراه و فناوری‌های اتصال داخلی هیولای وردپرس هستند.",
    },
    {
      id: 6,
      title: "وعده‌های غذایی سالم برای افزایش انرژی به‌صورت دیجیتال",
      subtitle: "دکوراسیون",
      subtitle2: "هیولای وردپرس",
      subtitle3: "   آبان 1403 ",
      img: "https://themes.wpmonster.co/Phlox/new/gadget-shop/wp-content/uploads/2024/04/rachit-tank-2cFZ_FB08UM-unsplash-min-637x388.jpeg",
      parg: "اِلِکترونیک دانشی است شامل فیزیک، مهندسی، فناوری و کاربردهایی که با جریان و کنترل الکترون‌ها در خلا و ماده سروکار دارد. در الکترونیک برای کنترل جریان الکترون از دستگاه‌های فعال تقویت و یکسوسازی استفاده می‌شود، درحالی‌که در مهندسی برق کلاسیک از اثرات غیرفعال مانند مقاومت، خازن و القاگر برای کنترل جریان الکتریسیته استفاده می‌شود.",
      parg2:
        "الکترونیک تأثیر عمده‌ای در پیشرفت جامعه مدرن داشته‌است. شناسایی الکترون در سال ۱۸۹۷، و سپس اختراع لامپ خلأ که می‌توانست سیگنال‌های کوچک الکتریکی را تقویت و یکسوسازی کند، زمینه الکترونیک و عصر الکترون را افتتاح کرد. این تمایز در حدود سال ۱۹۰۶ با اختراع لی دفارست از تریود آغاز شد، که تقویت الکتریکی سیگنال‌های رادیویی ضعیف و سیگنال‌های صوتی را با دستگاه غیر مکانیکی امکان‌پذیر کرد. تا سال ۱۹۵۰، این رشته «فناوری رادیویی» نامیده می‌شد زیرا کاربرد اصلی آن طراحی و تئوری فرستنده‌های رادیویی، گیرنده‌ها و لامپ‌های خلأ بود.",
      parg3:
        "عبارت «الکترونیک حالت-جامد» پس از ساخت اولین ترانزیستور توسط ویلیام شاکلی، والتر هاوسر براتین، جان باردین در آزمایشگاه‌های بل در ۱۹۴۷ ظهور کرد. سپس در سال ۱۹۵۹ ماسفت توسط محمد عطاالله (و همکارش داوون کانگ) اختراع شد. ماسفت اولین ترانزیستور کاملاً جمع و جور بود که می‌توانست برای طیف وسیعی از کاربردها کوچک سازی و تولید انبوه شود، که باعث ایجاد انقلابی در صنعت الکترونیک شد و نقشی اساسی در انقلاب میکروالکترونیک و انقلاب دیجیتال داشت. ماسفت از آن زمان به عنصر اصلی اکثر تجهیزات الکترونیکی مدرن تبدیل شده‌است و پرکاربردترین دستگاه الکترونیکی در جهان است.",
      parg4:
        "از الکترونیک به‌طور گسترده‌ای در پردازش اطلاعات، ارتباطات از راه دور و پردازش سیگنال استفاده می‌شود. توانایی دستگاه‌های الکترونیکی در عملکرد به عنوان کلید، پردازش اطلاعات دیجیتالی را امکان‌پذیر کرده‌است. فناوری‌های اتصال متقابل مانند بردهای مدار، فناوری بسته‌بندی الکترونیکی و سایر اشکال متنوع زیرساخت‌های ارتباطی، عملکرد مدار را کامل کرده و قطعات الکترونیکی مخلوط را به یک سیستم کاری منظم تبدیل می‌کنند، که سیستم الکترونیکی نامیده می‌شود. کامپیوترها یا سیستم‌های کنترل نمونه‌هایی از سیستم الکترونیکی هستند. یک سیستم الکترونیکی ممکن است جزئی از سیستم مهندسی شده دیگر یا یک دستگاه مستقل باشد. از سال ۲۰۱۹ بیشتر دستگاه‌های الکترونیکی[۳] از قطعات نیمه هادی برای انجام کنترل الکترون استفاده می‌کنند. معمولاً، دستگاه‌های الکترونیکی شامل مدارهای متشکل از نیمه رساناهای فعال با المان‌های غیرفعال مکمل هستند. چنین مداری به عنوان مدار الکترونیکی توصیف می‌شود. علم الکترونیک با مدارهای الکتریکی سروکار دارد که شامل اجزای الکتریکی فعال مانند لامپ‌های خلأ، ترانزیستورها، دیودها، مدارهای مجتمع، الکترونیک نوری، و سنسورها، قطعات الکتریکی غیرفعال همراه و فناوری‌های اتصال داخلی هیولای وردپرس هستند.",
    },
  ];

  const blogItem = blogData.find((item) => item.id === parseInt(id || "", 10));

  if (!blogItem) {
    return <p>آیتم مورد نظر پیدا نشد.</p>;
  }

  return (
    <>
      <div className="container-blog">
        <img className="blog-img" src={blogItem.img} alt={blogItem.title} />
        <div className="blog-text">
          <h1 className="blog-title">{blogItem.title}</h1>
          <h4 className="blog-subtitles">
            <span className="static-text">دسته بندی</span>
            <span className="dynamic-text">{blogItem.subtitle}</span>
            <span className="static-text"> نویسنده</span>
            <span className="dynamic-text">{blogItem.subtitle2}</span>
            <span className="static-text"> تاریخ انتشار</span>
            <span className="dynamic-text">{blogItem.subtitle3}</span>
          </h4>

          <p className="blog-parg">{blogItem.parg}</p>
          <p className="blog-parg">{blogItem.parg2}</p>
          <p className="blog-parg">{blogItem.parg3}</p>
          <p className="blog-parg">{blogItem.parg4}</p>
        </div>
        <div className="blog-lastline">
          <div className="blog-right">
            <span className="blog-text1">برچسب ها: </span>
            <span className="blog-text2">تکنولوژی ، گجت</span>
          </div>
          <div className="blog-left">
            <li className="blog-shareIcon">
              <IoShareSocialOutline />
            </li>
            <li className="blog-favIcon">
              <GrFavorite />
            </li>
          </div>
        </div>
      </div>

      <section className="answers-section">
        <div className="answers-text">
          <h1 className="answers-title">یک پاسخ</h1>
          <div className="answer-box">
            <div>
              <img src="/img/ax.jpg" alt="ax" className="answer-box__img" />
            </div>
            <div className="answer-box__text">
              <div className="answer-box__text1">
                <h1 className="answers-user">فاطمه عموئی</h1>
                <h1 className="answers-date">آبان 1403 در 8:29 بعد از ظهر</h1>
              </div>
              <div className="answer-box__text2">
                <h4 className="answers-answer">
                  از آنجایی که طراحان عموما نویسنده متن نیستند و وظیفه رعایت حق
                  تکثیر متون را ندارند و در همان حال کار آنها به نوعی وابسته به
                  متن می‌باشد آنها با استفاده از محتویات ساختگی، صفحه گرافیکی
                  خود را صفحه‌آرایی می‌کنند تا مرحله طراحی و صفحه‌بندی را به
                  پایان برند.
                </h4>
              </div>
            </div>
          </div>
        </div>
      </section>

      <section className="comments-section">
        <div className="comments-text">
          <h1 className="comments-title">دیدگاه شما چیست؟ </h1>
          <h4 className="comments-subtitles">
            * آدرس ایمیل شما منتشر نخواهد شد، فیلدهای الزامی علامت گذاری شده اند
          </h4>
        </div>
        <Form className="comments-form">
          <Row className="comments-form__row">
            <Col>
              <Form.Label className="comments-form__label" htmlFor="inputName">
                نام (ضروری) *
              </Form.Label>
              <Form.Control id="comments-inputName" />
            </Col>
            <Col>
              <Form.Label className="comments-form__label" htmlFor="inputEmail">
                ایمیل (ضروری)*
              </Form.Label>
              <Form.Control id="inputEmail" />
            </Col>
          </Row>

          <Form.Label className="comments-form__label" htmlFor="inputMessage">
            دیدگاه
          </Form.Label>
          <Form.Control
            as="textarea"
            id="inputMessage"
            style={{ height: "400px" }}
          />
          <div className=".comments-btn__container">
            <Button className="comments-btn__submit" type="submit">
              تائید
            </Button>
          </div>
        </Form>
      </section>
    </>
  );
}
